{
    "title": "SkyKettle",
    "config": {
        "abort": {
            "no_bluetooth": "Seems like the Bluetooth integration is not installed or not working. This integration depends on it.",
            "kettle_not_found": "Can't find any supported kettle. Please make sure that your kettle is in the list of supported devices and it's on the stand.",
            "already_configured": "Integration for this kettle is already configured.",
            "unknown_model": "Your kettle model is not yet supported by this integration. But you can help add support for it! Contact the author via the 'issues' section on GitHub ('report an issue' in HACS).",
            "unknown": "Unknown error, please check logs."
        },
        "error": {
            "cant_connect": "Can't connect to the kettle. Please make sure that it's on the stand.",
            "cant_auth": "Connected to the kettle but pairing failed. Please try again."
        },
        "step": {
            "scan_message": {
                "title": "Automatic discovery of the kettle",
                "description": "Make sure that the Kettle is on the stand and it's plugged into the outlet then proceed."
            },
            "scan": {
                "title": "MAC Address",
                "description": "Select your kettle.",
                "data": {
                    "mac": "MAC address of the kettle"
                }
            },
            "connect": {
                "title": "First connect",
                "description": "Please put your kettle into pairing mode (check the user manual, usually need to hold some button for 10 seconds) before next step."
            },            
            "init": {
                "title": "SkyKettle Options",
                "description": "Finally, you can tune some options if your want.",
                "data": {
                    "persistent_connection": "Persistent connection (faster but exclusive, e.g. you can't use the official app while this integration is in work)",
                    "scan_interval": "Kettle polling interfal in seconds (very low values recommended only for persistent connection)"
                }
            }
        }
    },
    "options": {
        "step": {
            "init": {
                "title": "SkyKettle Options",
                "data": {
                    "persistent_connection": "Persistent connection. Faster but exclusive, e.g. you can't use the official app while this integration is in work.",
                    "scan_interval": "Kettle polling interfal in seconds. Very low values recommended only for persistent connection."
                }
            }
        }
    }
}
